# 4. Представлен список чисел. Необходимо вывести те его элементы,
# значения которых больше предыдущего, например:
# src = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
# result = [12, 44, 4, 10, 78, 123]
# Выводить или не выводить первый элемент - решите сами.
# Используйте генераторы или генераторные выражения.

src = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
# src = [1, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]


def gen_num(list_of_numbers):
    m = list_of_numbers[0]
    for i in src:
        if i > m:
            yield i
            m = i
        else:
            m = i


result = []
for el in gen_num(src):
    result.append(el)
print(result)
